{
  "token_to_id": {
    "<PAD>": 0,
    "Bar_BOS": 1,
    "Bar_EOS": 2,
    "Pos_0": 3,
    "Note_74": 4,
    "Duration_3": 5,
    "Note_69": 6,
    "Duration_8": 7,
    "Note_64": 8,
    "Note_62": 9,
    "Note_60": 10,
    "Duration_6": 11,
    "Note_57": 12,
    "Note_45": 13,
    "Note_33": 14,
    "Pos_6": 15,
    "Duration_2": 16,
    "Note_52": 17,
    "Duration_1": 18,
    "Pos_8": 19,
    "Pos_10": 20,
    "Pos_12": 21,
    "Pos_14": 22,
    "Pos_16": 23,
    "Note_72": 24,
    "Pos_18": 25,
    "Pos_20": 26,
    "Note_71": 27,
    "Note_59": 28,
    "Pos_22": 29,
    "Note_67": 30,
    "Pos_24": 31,
    "Duration_4": 32,
    "Pos_26": 33,
    "Pos_28": 34,
    "Note_55": 35,
    "Note_47": 36,
    "Note_35": 37,
    "Pos_2": 38,
    "Pos_4": 39,
    "Pos_30": 40,
    "Note_40": 41,
    "Duration_12": 42,
    "Note_50": 43,
    "Note_38": 44,
    "Note_26": 45,
    "Duration_16": 46,
    "Note_76": 47,
    "Note_84": 48,
    "Note_83": 49,
    "Note_81": 50,
    "Note_48": 51,
    "Note_36": 52,
    "Note_43": 53,
    "Note_31": 54,
    "Note_41": 55,
    "Note_29": 56,
    "Note_79": 57,
    "Note_86": 58,
    "Note_24": 59,
    "Note_88": 60,
    "Note_53": 61,
    "Note_28": 62,
    "Duration_32": 63,
    "Duration_24": 64,
    "Note_77": 65,
    "Note_89": 66,
    "Note_65": 67,
    "Note_78": 68,
    "Note_73": 69,
    "Note_66": 70,
    "Note_54": 71,
    "Note_42": 72,
    "Note_30": 73,
    "Note_85": 74,
    "Note_61": 75,
    "Note_49": 76,
    "Note_37": 77,
    "Note_68": 78,
    "Note_25": 79,
    "Note_44": 80,
    "Note_32": 81,
    "Note_70": 82,
    "Note_58": 83,
    "Note_46": 84,
    "Note_34": 85,
    "Note_80": 86,
    "Note_56": 87,
    "Note_75": 88,
    "Note_63": 89,
    "Note_51": 90,
    "Note_39": 91,
    "Note_93": 92,
    "Note_27": 93,
    "Note_82": 94,
    "Note_87": 95,
    "Note_92": 96,
    "Note_91": 97,
    "Note_94": 98,
    "Note_90": 99,
    "Note_95": 100,
    "Note_22": 101,
    "Note_98": 102,
    "Note_23": 103,
    "Note_96": 104,
    "Note_100": 105,
    "Note_99": 106,
    "Note_21": 107,
    "Note_97": 108,
    "Pos_36": 109,
    "Pos_38": 110,
    "Pos_42": 111,
    "Pos_34": 112,
    "Pos_46": 113,
    "Pos_40": 114,
    "Pos_32": 115,
    "Pos_44": 116,
    "Pos_54": 117,
    "Pos_48": 118,
    "Pos_62": 119,
    "Pos_50": 120,
    "Pos_56": 121,
    "Pos_60": 122,
    "Pos_52": 123,
    "Pos_58": 124,
    "Grace_1": 125,
    "Grace_-1": 126,
    "<UNK>": 127
  },
  "special_tokens": ["<PAD>", "<UNK>"]
}
